
<details><summary>Show Plan</summary>

``` terraform
terraform
module.sdk_analysis.module.lambda.null_resource.docker_build: Refreshing state... [id=237655538103629768]
module.sdk_analysis.module.ecs_task.null_resource.docker_build: Refreshing state... [id=494194448135757223]
module.sdk_analysis.module.ecs_task.aws_default_vpc.default_vpc: Refreshing state... [id=vpc-c817d3b5]
module.downloads[0].aws_s3_bucket.log_bucket: Refreshing state... [id=curibio-modl-server-access-logs]
module.sdk_analysis.aws_s3_bucket.upload_bucket: Refreshing state... [id=modl-sdk-upload]
module.sdk_analysis.module.ecs_task.aws_cloudwatch_log_group.sdk-analysis-logs: Refreshing state... [id=modl-sdk-analysis]
module.sdk_analysis.module.ecs_task.aws_ecr_repository.ecr: Refreshing state... [id=modl-sdk_analysis]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_b: Refreshing state... [id=subnet-641f6429]
module.sdk_analysis.module.ecs_task.aws_ecs_cluster.aws-ecs-cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:725604423866:cluster/modl-sdk_analysis-cluster]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_a: Refreshing state... [id=subnet-58d96f79]
module.downloads[0].aws_iam_role.downloads_role: Refreshing state... [id=s3_downloads_role]
module.sdk_analysis.aws_sqs_queue.sdk_queue_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/725604423866/modl-sdk-queue-deadletter]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_c: Refreshing state... [id=subnet-f2f246ad]
module.sdk_analysis.aws_s3_bucket.analyzed_bucket: Refreshing state... [id=modl-sdk-analyzed]
module.downloads[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:725604423866:certificate/691b9483-8679-4d94-82e4-c53a2ff634fc]
module.downloads[0].aws_route53_zone.main: Refreshing state... [id=Z03799832ACKUNJ8IZDHB]
module.sdk_analysis.module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=modl-sdk_upload]
module.jupyter_notebook[0].aws_s3_bucket.jupyter: Refreshing state... [id=jupyter-sdk.curibio-modl.com]
module.sdk_analysis.module.ecs_task.aws_iam_role.ecsTaskExecutionRole: Refreshing state... [id=modl-sdk_analysis-execution-task-role]
module.sdk_analysis.module.ecs_task.null_resource.docker_tag: Refreshing state... [id=134254638304935216]
module.sdk_analysis.module.lambda.null_resource.docker_tag: Refreshing state... [id=3977070376333150817]
module.sdk_analysis.module.ecs_task.null_resource.docker_push: Refreshing state... [id=1966001569761004287]
module.sdk_analysis.module.lambda.null_resource.docker_push: Refreshing state... [id=2561484821548041148]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.additional_inline[0]: Refreshing state... [id=modl-sdk-upload-lambda]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=modl-sdk-upload-lambda-logs]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/modl-sdk-upload-lambda]
module.jupyter_notebook[0].aws_cloudfront_distribution.jupyter_sdk_distribution: Refreshing state... [id=E2E51DTG2P23PH]
module.downloads[0].aws_route53_record.google_site_verification: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_TXT]
module.downloads[0].aws_route53_record.sqsp_verify: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_862laeb5r7tfnxngc2mc_CNAME]
module.downloads[0].aws_route53_record.github_verification: Refreshing state... [id=Z03799832ACKUNJ8IZDHB__github-challenge-curibio.www.curibio.com_TXT]
module.downloads[0].aws_route53_record.sqsp_www: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_www_CNAME]
module.downloads[0].aws_route53_record.cname_ssl_verification["*.curibio-modl.com"]: Refreshing state... [id=Z03799832ACKUNJ8IZDHB__57b523665a1e9e3baef95f3dc85315ae.curibio-modl.com._CNAME]
module.downloads[0].aws_route53_record.a_record: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_A]
module.downloads[0].aws_route53_record.mx_record: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_MX]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=modl-sdk-upload-lambda]
module.sdk_analysis.module.ecs_task.aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy: Refreshing state... [id=modl-sdk_analysis-execution-task-role-20210910222144615700000001]
module.jupyter_notebook[0].aws_route53_record.jupyter_cname: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_jupyter-sdk.curibio-modl.com_CNAME]
module.downloads[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2021-03-16 22:33:28 +0000 UTC]
module.downloads[0].aws_s3_bucket.downloads: Refreshing state... [id=downloads.curibio-modl.com]
module.sdk_analysis.aws_sqs_queue.sdk_upload_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/725604423866/modl-sdk-upload-queue]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::725604423866:policy/modl-sdk-upload-lambda-logs]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::725604423866:policy/modl-sdk-upload-lambda-inline]
module.sdk_analysis.module.ecs_task.aws_iam_role.ecs_task_role: Refreshing state... [id=modl-sdk_analysis-ecs_task_role]
module.sdk_analysis.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=modl-sdk-upload]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=modl-sdk-upload-lambda]
module.sdk_analysis.module.ecs_task.aws_ecs_task_definition.aws-ecs-task: Refreshing state... [id=modl-sdk_analysis-ecs-task-definition]
module.downloads[0].aws_s3_bucket_policy.downloads_policy: Refreshing state... [id=downloads.curibio-modl.com]
module.downloads[0].aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1CI0FY7D89ZVE]
module.downloads[0].aws_iam_role_policy.s3_downloads: Refreshing state... [id=s3_downloads_role:s3_downloads_policy]
module.downloads[0].aws_route53_record.cname: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_downloads.curibio-modl.com_CNAME]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.api.aws_apigatewayv2_api.example will be created
  + resource "aws_apigatewayv2_api" "example" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "modl-example"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.api.aws_apigatewayv2_integration.example will be created
  + resource "aws_apigatewayv2_integration" "example" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "Lambda example"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:725604423866:function:modl-sdk-upload-lambda/invocations"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api.aws_apigatewayv2_route.example will be created
  + resource "aws_apigatewayv2_route" "example" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /example/{proxy+}"
      + target             = (known after apply)
    }

  # module.api.aws_apigatewayv2_stage.example will be created
  + resource "aws_apigatewayv2_stage" "example" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "modl-example-stage"
      + tags_all      = (known after apply)

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }
    }

  # module.api.aws_cloudwatch_log_group.api_gw will be created
  + resource "aws_cloudwatch_log_group" "api_gw" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "modl/aws/api_gw/modl-example"
      + retention_in_days = 0
      + tags              = {
          + "Application" = "api-gw"
          + "Environment" = "modl"
        }
      + tags_all          = {
          + "Application" = "api-gw"
          + "Environment" = "modl"
        }
    }

  # module.api.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "modl-iam_for_lambda"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.api.aws_iam_role_policy_attachment.lambda_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "modl-iam_for_lambda"
    }

  # module.api.aws_lambda_permission.lambda_permission will be created
  + resource "aws_lambda_permission" "lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "sdk-upload-lambda"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowSDKUploadAPIInvoke"
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_service.aws-ecs-service will be created
  + resource "aws_ecs_service" "aws-ecs-service" {
      + cluster                            = "arn:aws:ecs:us-east-1:725604423866:cluster/modl-sdk_analysis-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "modl-sdk_analysis-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:us-east-1:725604423866:task-definition/modl-sdk_analysis-ecs-task-definition:1"
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + subnets          = [
              + "subnet-58d96f79",
              + "subnet-641f6429",
              + "subnet-f2f246ad",
            ]
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.additional_inline[0] will be destroyed
  - resource "aws_iam_policy_attachment" "additional_inline" {
      - groups     = [] -> null
      - id         = "modl-sdk-upload-lambda" -> null
      - name       = "modl-sdk-upload-lambda" -> null
      - policy_arn = "arn:aws:iam::725604423866:policy/modl-sdk-upload-lambda-inline" -> null
      - roles      = [
          - "modl-sdk-upload-lambda",
        ] -> null
      - users      = [] -> null
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0] will be destroyed
  - resource "aws_iam_policy_attachment" "logs" {
      - groups     = [] -> null
      - id         = "modl-sdk-upload-lambda-logs" -> null
      - name       = "modl-sdk-upload-lambda-logs" -> null
      - policy_arn = "arn:aws:iam::725604423866:policy/modl-sdk-upload-lambda-logs" -> null
      - roles      = [
          - "modl-sdk-upload-lambda",
        ] -> null
      - users      = [] -> null
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::725604423866:policy/modl-sdk-upload-lambda-inline"
      + role       = "modl-sdk-upload-lambda"
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::725604423866:policy/modl-sdk-upload-lambda-logs"
      + role       = "modl-sdk-upload-lambda"
    }

Plan: 11 to add, 0 to change, 2 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...

```

</details>

Pusher: @tannermpeterson